
/*°′″  «»  ≤≥  ≠≈  —¦  ÷×  !¡  ©®  £€  $¢  №⋕  λμ  πφ  ∑∏  ¶§  †‡  ±∞  √∆  ∫∳

'''
clang
-std=c11
-o single
-march=armv8.2-A
-ferror-limit=5
/sdcard/C/ungop.c
-I/sdcard/C
'''

CHANGES:

24-04-17
* created anyop.h
* deleted some more 256/512 bit vector types

24-04-20
* deleted extraneous dupl ops

24-04-23
* fixed ldrw defs
* added missing lun1
* fixed lunw, lund, and lunq (they didn't work w/ floats)
* added add2 defs

24-04-25
* fix razwwwf, razdwwf, and razfwwf defs

24-04-28
* (re)add sirr

*/

#if _ENTER_EXTDEF
{
#endif
/*°′″  «»  ≤≥  ≠≈  —¦  ÷×  !¡  ©®  £€  $¢  №⋕  λμ  πφ  ∑∏  ¶§  †‡  ±∞  √∆  ∫∳

This used to be a file <extdef.h>

*/

#ifndef MY_EXTDEF_H // BOF
#define MY_EXTDEF_H

#ifndef __STDC_VERSION__
#error "__STDC_VERSION__ is unavailable"
#endif

#if   __STDC_VERSION__ < 201112L
#error "C11 is required"
#endif

#if     __STDC_HOSTED__ != 1
#error "__STDC_HOSTED__ != 1"
#endif

#undef  SAFECALL
#undef  MY_CALL
#undef  MY_SWAP
#undef  uchar
#undef  schar
#undef  ushrt
#undef  ushort
#undef  shrt
#undef  uint
#undef  ulong
#undef  ullong
#undef  llong

#undef  IGNORED
#undef  IDENTITY
#undef  INLINE
#undef  INTRIN
#undef  PUBLIC
#undef  RESTRICT

#undef  ASSERT

#undef  UNUSED
#undef  UNREACHABLE

#define Rc(...) int const
#define Wc(...) unsigned const
#define Lc(...) unsigned long const

#define     MY_REQS(T,X,Y) _Generic(X,T:Y)

#define     BOOL_REQS(X)    MY_REQS(   BOOL_TYPE,(X),(X))
#define     CHAR_REQS(X)    MY_REQS(   CHAR_TYPE,(X),(X))

M## 64 N,M## 65 N,M## 66 N,M## 67 N,M## 68 N,M## 69 N,M## 70 N,M## 71 N,\
M## 72 N,M## 73 N,M## 74 N,M## 75 N,M## 76 N,M## 77 N,M## 78 N,M## 79 N,\
M## 80 N,M## 81 N,M## 82 N,M## 83 N,M## 84 N,M## 85 N,M## 86 N,M## 87 N,\
M## 88 N,M## 89 N,M## 90 N,M## 91 N,M## 92 N,M## 93 N,M## 94 N,M## 95 N,\
M## 96 N,M## 97 N,M## 98 N,M## 99 N,M##100 N,M##101 N,M##102 N,M##103 N,\
M##104 N,M##105 N,M##106 N,M##107 N,M##108 N,M##109 N,M##110 N,M##111 N,\
M##112 N,M##113 N,M##114 N,M##115 N,M##116 N,M##117 N,M##118 N,M##119 N,\
M##120 N,M##121 N,M##122 N,M##123 N,M##124 N,M##125 N,M##126 N,M##127 N

#define MY_BV1(M, N)  M##0 N
#define MY_BV2(M, N)  M##1 N,MY_BV1(M,N)
#define MY_BV3(M, N)  M##2 N,MY_BV2(M,N)
#define MY_BV4(M, N)  M##3 N,MY_BV3(M,N)
#define MY_BV5(M, N)  M##4 N,MY_BV4(M,N)
#define MY_BV6(M, N)  M##5 N,MY_BV5(M,N)
#define MY_BV7(M, N)  M##6 N,MY_BV6(M,N)
#define MY_BV8(M, N)  M##7 N,MY_BV7(M,N)

#define MY_BV16(M, N) \
M##15 N,M##14 N,M##13 N,M##12 N,M##11 N,M##10 N,M## 9 N,M## 8 N,\
MY_BV8(M,N)

#define MY_BV32(M, N) \
M##31 N,M##30 N,M##29 N,M##28 N,M##27 N,M##26 N,M##25 N,M##24 N,\
M##23 N,M##22 N,M##21 N,M##20 N,M##19 N,M##18 N,M##17 N,M##16 N,\
MY_BV16(M,N)

#define MY_BV64(M, N) \
M##63 N,M##62 N,M##61 N,M##60 N,M##59 N,M##58 N,M##57 N,M##56 N,\
M##55 N,M##54 N,M##53 N,M##52 N,M##51 N,M##50 N,M##49 N,M##48 N,\
M##47 N,M##46 N,M##45 N,M##44 N,M##43 N,M##42 N,M##41 N,M##40 N,\
M##39 N,M##38 N,M##37 N,M##36 N,M##35 N,M##34 N,M##33 N,M##32 N,\
MY_BV32(M,N)

#define MY_BV128(M, N) \
M##127 N,M##126 N,M##125 N,M##124 N,M##123 N,M##122 N,M##121 N,M##120 N,\
M##119 N,M##118 N,M##117 N,M##116 N,M##115 N,M##114 N,M##113 N,M##112 N,\
M##111 N,M##110 N,M##109 N,M##108 N,M##107 N,M##106 N,M##105 N,M##104 N,\
M##103 N,M##102 N,M##101 N,M##100 N,M## 99 N,M## 98 N,M## 97 N,M## 96 N,\
M## 95 N,M## 94 N,M## 93 N,M## 92 N,M## 91 N,M## 90 N,M## 89 N,M## 88 N,\
M## 87 N,M## 86 N,M## 85 N,M## 84 N,M## 83 N,M## 82 N,M## 81 N,M## 80 N,\
M## 79 N,M## 78 N,M## 77 N,M## 76 N,M## 75 N,M## 74 N,M## 73 N,M## 72 N,\
M## 71 N,M## 70 N,M## 69 N,M## 68 N,M## 67 N,M## 66 N,M## 65 N,M## 64 N,\
MY_BV64(M,N)

#if MY_ENDIAN == ENDIAN_LIL
#   ifndef  MY_PAIR
#   define  MY_PAIR     MY_LIL_PAIR
#   endif

#   ifndef  MY_NVX
#   define  MY_NVX(N)   MY_LV##N
#   endif

#endif

#if MY_ENDIAN == ENDIAN_BIG
#   ifndef  MY_PAIR
#   define  MY_PAIR     MY_BIG_PAIR
#   endif

#   ifndef  MY_NVX
#   define  MY_NVX(N)   MY_BV##N
#   endif

#endif

#define MY_NV1      MY_NVX(1)
#define MY_NV2      MY_NVX(2)
#define MY_NV3      MY_NVX(3)
#define MY_NV4      MY_NVX(4)
#define MY_NV5      MY_NVX(5)
#define MY_NV6      MY_NVX(6)
#define MY_NV7      MY_NVX(7)
#define MY_NV8      MY_NVX(8)
#define MY_NV16     MY_NVX(16)
#define MY_NV32     MY_NVX(32)
#define MY_NV64     MY_NVX(64)
#define MY_NV128    MY_NVX(128)

#define MY_BZ {uint8_t  U; int8_t  I;}
#define MY_HZ {uint16_t U; int16_t I;}
#define MY_WZ {uint32_t U; int32_t I;}
#define MY_DZ {uint64_t U; int64_t I;}

#if _LEAVE_EXTNUM_NV
}
#endif

#if _ENTER_EXTNUM_XFLT
{
#endif

#if FLT16_ENDIAN == ENDIAN_LIL

struct Xhfl {
    union {
        struct {uint8_t Mant;};
        union MY_BZ;
    };
};

struct Xhfr {
    union {
        struct {uint8_t  Mant: 2, Expo: 5, Sign:1, :0;};
        union MY_BZ;
    };
};

typedef struct Xhf {
    union {
        struct {struct Xhfl Lo; struct Xhfr Hi;};
        struct {uint16_t Mant: 10, Expo: 5, Sign: 1, :0;};
        union MY_HZ;
    };
} Xhf;

#else
#error "berg endian flt16"
#endif

#if FLT_ENDIAN == ENDIAN_LIL

struct Xwfl {
    union {
        struct {uint16_t Mant;};
        union MY_HZ;
    };
};

struct Xwfr {
    union {
        struct {uint16_t Mant: 7, Expo: 8, Sign:1, :0;};
        union MY_HZ;
    };
};

typedef struct Xwf {
    union {
        struct {struct Xwfl Lo; struct Xwfr Hi;};
        struct {uint32_t Mant:23, Expo: 8, Sign:1, :0;};
        union MY_WZ;
    };
} Xwf;

#else
#error "berg endian flt32"
#endif

#if DBL_ENDIAN == ENDIAN_LIL

struct Xdfl {
    union {
        struct {uint32_t Mant;};
        union MY_WZ;
    };
};

struct Xdfr {
    union {
        struct {uint32_t Mant:20,Expo:11, Sign: 1, :0;};
        union MY_WZ;
    };
};

typedef struct Xdf {
    union {
        struct {struct Xdfl Lo; struct Xdfr Hi;};
        struct {uint64_t Mant:52, Expo:11, Sign:1, :0;};
        union MY_DZ;
    };
} Xdf;
#else
#error "berg endian flt64"
#endif

struct Xqfl {
    union {
        struct {uint64_t Mant;};
        union MY_DZ;
    };
};
struct Xqfr {
    union {
        struct {uint64_t Mant:48, Expo:15, Sign:1, :0;};
        union MY_DZ;
    };
};
typedef struct Xqf {
    union {
        struct {struct Xqfl Lo; struct Xqfr Hi;};
    };
} Xqf;

#if defined(FLT16_MTYPE)
typedef FLT16_MTYPE flt16_t;
#else
typedef struct Xhf flt16_t;
#endif

typedef float  flt32_t;
typedef double flt64_t;

#if LDBL_MANT_DIG == 113
#   define  QUAD_FTYPE long double
#else
#   define  QUAD_FTYPE struct Xqf
#endif

typedef QUAD_FTYPE flt128_t;

#if _LEAVE_XFLT
}
#endif

#if _ENTER_EXTNUM_HOMOGENOUS_AGGREGATES
{
#endif

typedef struct Yu8      {_Bool MY_NV8(K,:1);}   Yu8;
typedef struct Yu16     {_Bool MY_NV16(K,:1);}  Yu16;
typedef struct Yu32     {_Bool MY_NV32(K,:1);}  Yu32;
typedef struct Yu64     {_Bool MY_NV64(K,:1);}  Yu64;
typedef struct Yu128    {_Bool MY_NV128(K,:1);}  Yu128;

typedef struct Bc1  {char MY_NV1(K,);}      Bc1;
typedef struct Bc2  {char MY_NV2(K,);}      Bc2;
typedef struct Bc3  {char MY_NV3(K,);}      Bc3;
typedef struct Bc4  {char MY_NV4(K,);}      Bc4;
typedef struct Bc8  {char MY_NV8(K,);}      Bc8;
typedef struct Bc16 {char MY_NV16(K,);}     Bc16;
typedef struct Bc32 {char MY_NV32(K,);}     Bc32;
typedef struct Bc64 {char MY_NV64(K,);}     Bc64;

typedef struct Bu1  {uint8_t MY_NV1(K,);}   Bu1;
typedef struct Bu2  {uint8_t MY_NV2(K,);}   Bu2;
typedef struct Bu3  {uint8_t MY_NV3(K,);}   Bu3;
typedef struct Bu4  {uint8_t MY_NV4(K,);}   Bu4;
typedef struct Bu8  {uint8_t MY_NV8(K,);}   Bu8;
typedef struct Bu16 {uint8_t MY_NV16(K,);}  Bu16;
typedef struct Bu32 {uint8_t MY_NV32(K,);}  Bu32;
typedef struct Bu64 {uint8_t MY_NV64(K,);}  Bu64;

typedef struct Bi1  {int8_t MY_NV1(K,);}    Bi1;
typedef struct Bi2  {int8_t MY_NV2(K,);}    Bi2;
typedef struct Bi3  {int8_t MY_NV3(K,);}    Bi3;
typedef struct Bi4  {int8_t MY_NV4(K,);}    Bi4;
typedef struct Bi8  {int8_t MY_NV8(K,);}    Bi8;
typedef struct Bi16 {int8_t MY_NV16(K,);}   Bi16;
typedef struct Bi32 {int8_t MY_NV32(K,);}   Bi32;
typedef struct Bi64 {int8_t MY_NV64(K,);}   Bi64;

typedef struct Hu1  {uint16_t MY_NV1(K,);}  Hu1;
typedef struct Hu2  {uint16_t MY_NV2(K,);}  Hu2;
typedef struct Hu3  {uint16_t MY_NV3(K,);}  Hu3;
typedef struct Hu4  {uint16_t MY_NV4(K,);}  Hu4;
typedef struct Hu8  {uint16_t MY_NV8(K,);}  Hu8;
typedef struct Hu16 {uint16_t MY_NV16(K,);} Hu16;

typedef struct Hi1  {int16_t MY_NV1(K,);}   Hi1;
typedef struct Hi2  {int16_t MY_NV2(K,);}   Hi2;
typedef struct Hi3  {int16_t MY_NV3(K,);}   Hi3;
typedef struct Hi4  {int16_t MY_NV4(K,);}   Hi4;
typedef struct Hi8  {int16_t MY_NV8(K,);}   Hi8;
typedef struct Hi16 {int16_t MY_NV16(K,);}  Hi16;

typedef struct Hf1  {flt16_t MY_NV1(K,);}   Hf1;
typedef struct Hf2  {flt16_t MY_NV2(K,);}   Hf2;
typedef struct Hf3  {flt16_t MY_NV3(K,);}   Hf3;
typedef struct Hf4  {flt16_t MY_NV4(K,);}   Hf4;
typedef struct Hf8  {flt16_t MY_NV8(K,);}   Hf8;
typedef struct Hf16 {flt16_t MY_NV16(K,);}  Hf16;

typedef struct Wu1  {uint32_t MY_NV1(K,);}  Wu1;
typedef struct Wu2  {uint32_t MY_NV2(K,);}  Wu2;
typedef struct Wu3  {uint32_t MY_NV3(K,);}  Wu3;
typedef struct Wu4  {uint32_t MY_NV4(K,);}  Wu4;
typedef struct Wu8  {uint32_t MY_NV8(K,);}  Wu8;
typedef struct Wu16 {uint32_t MY_NV16(K,);} Wu16;

typedef struct Wi1  {int32_t MY_NV1(K,);}   Wi1;
typedef struct Wi2  {int32_t MY_NV2(K,);}   Wi2;
typedef struct Wi3  {int32_t MY_NV3(K,);}   Wi3;
typedef struct Wi4  {int32_t MY_NV4(K,);}   Wi4;
typedef struct Wi8  {int32_t MY_NV8(K,);}   Wi8;
typedef struct Wi16 {int32_t MY_NV16(K,);}  Wi16;

typedef struct Wf1  {float MY_NV1(K,);}     Wf1;
typedef struct Wf2  {float MY_NV2(K,);}     Wf2;
typedef struct Wf3  {float MY_NV3(K,);}     Wf3;
typedef struct Wf4  {float MY_NV4(K,);}     Wf4;
typedef struct Wf8  {float MY_NV8(K,);}     Wf8;
typedef struct Wf16 {float MY_NV16(K,);}    Wf16;

typedef struct Du1  {uint64_t MY_NV1(K,);}  Du1;
typedef struct Du2  {uint64_t MY_NV2(K,);}  Du2;
typedef struct Du3  {uint64_t MY_NV3(K,);}  Du3;
typedef struct Du4  {uint64_t MY_NV4(K,);}  Du4;
typedef struct Du8  {uint64_t MY_NV8(K,);}  Du8;

typedef struct Di1  {int64_t MY_NV1(K,);}   Di1;
typedef struct Di2  {int64_t MY_NV2(K,);}   Di2;
typedef struct Di3  {int64_t MY_NV3(K,);}   Di3;
typedef struct Di4  {int64_t MY_NV4(K,);}   Di4;
typedef struct Di8  {int64_t MY_NV8(K,);}   Di8;

typedef struct Df1  {double MY_NV1(K, );}   Df1;
typedef struct Df2  {double MY_NV2(K, );}   Df2;
typedef struct Df3  {double MY_NV3(K, );}   Df3;
typedef struct Df4  {double MY_NV4(K, );}   Df4;
typedef struct Df8  {double MY_NV8(K, );}   Df8;

typedef struct Qu1  {QUAD_UTYPE MY_NV1(K,);}    Qu1;
typedef struct Qu2  {QUAD_UTYPE MY_NV2(K,);}    Qu2;
typedef struct Qu3  {QUAD_UTYPE MY_NV3(K,);}    Qu3;
typedef struct Qu4  {QUAD_UTYPE MY_NV4(K,);}    Qu4;
typedef struct Qu8  {QUAD_UTYPE MY_NV8(K,);}    Qu8;

typedef struct Qi1  {QUAD_ITYPE MY_NV1(K, );}   Qi1;
typedef struct Qi2  {QUAD_ITYPE MY_NV2(K, );}   Qi2;
typedef struct Qi3  {QUAD_ITYPE MY_NV3(K, );}   Qi3;
typedef struct Qi4  {QUAD_ITYPE MY_NV4(K, );}   Qi4;
typedef struct Qi8  {QUAD_ITYPE MY_NV8(K, );}   Qi8;

typedef struct Qf1  {QUAD_FTYPE MY_NV1(K, );}   Qf1;
typedef struct Qf2  {QUAD_FTYPE MY_NV2(K, );}   Qf2;
typedef struct Qf3  {QUAD_FTYPE MY_NV3(K, );}   Qf3;
typedef struct Qf4  {QUAD_FTYPE MY_NV4(K, );}   Qf4;
typedef struct Qf8  {QUAD_FTYPE MY_NV8(K, );}   Qf8;

#if _LEAVE_EXTNUM_HOMOGENOUS_AGGREGATES
}
#endif

/*
The following union types may be used to replace almost
any throwaway union used for scalar type punning.

*   T.Lo contains the lower half of a value's
    representation while T.Hi contains its upper half.
    E.g. ((union Half){.U=0xff00}).Hi evaluates to 255
    (0xff), since the Hi member contains a halfword's
    upper 8 bits.

*   Individual bits can be referenced using the Y
    members. ((Dwrd){.U=x}).Y37 is equivalent to
    (((uint64_t) x)>>37)&1

*   The M.U, M.I, and M.F members contain packed
    versions of the U, I, F members. However, the lun*
    and sun* operations already guarantee the most
    efficient access of packed data, so these should
    only ever be used in their implementation.

*/

typedef union Byte {
    char        C[1];
    uint8_t     U;
    int8_t      I;
    _Bool       Y;
    union       {Bu1 U; Bi1 I; Bc1 C;} M1;
    struct      {bool       MY_NV8(Y,:1),:0;};
    struct      {char       MY_NV1(C,);};
    struct      {uint8_t    MY_NV1(U,);};
    struct      {int8_t     MY_NV1(I,);};
} Byte;

typedef union Half {
    char        C[2];
    Byte        B[2];
    union       {Hu1 U; Hi1 I; Hf1 F;} M1;
    union       {Bu2 U; Bi2 I; Bc2 C;} M2;
    uint16_t    U;
    int16_t     I;
    flt16_t     F;
    struct      {bool   MY_NV16(Y, :1), :0; };
    struct      {char   MY_NV2( C,  );      };
    struct      {Byte   MY_NV2( B,  );      };
    struct      {Byte   MY_PAIR(Lo, Hi,  ); };
#if HALF_NPTR
    void        *A[HALF_NPTR];
    struct      {void   MY_NV1(*A,  );      };
#endif

    struct {
        uint16_t
            Mant:   10,
            Expo:   5,
            Sign:   1,
            :       0;
    };

    union {
#if defined(_MSC_VER)
#   pragma pack(push,1)
        uint16_t    U;
        int16_t     I;
        flt16_t     F;
#   pragma pack(pop)
#else
        uint16_t    U __attribute__((packed));
        int16_t     I __attribute__((packed));
        flt16_t     F __attribute__((packed));
#endif

    } M;

} Half;

typedef union Word {
    char           C[4];
    Byte        B[4];
    Half        H[2];
    union       {Wu1 U; Wi1 I; Wf1 F;} M1;
    union       {Hu2 U; Hi2 I; Hf2 F;} M2;
    union       {Bu4 U; Bi4 I; Bc4 C;} M4;
    uint32_t    U;
    int32_t     I;
    float       F;
    struct      {bool   MY_NV32(Y, :1), :0; };
    struct      {char   MY_NV4( C,  );      };
    struct      {Byte   MY_NV4( B,  );      };
    struct      {Half   MY_NV2( H,  );      };
    struct      {Half   MY_PAIR(Lo, Hi,  ); };
#if WORD_NPTR
    void        *A[WORD_NPTR];
#   if WORD_NPTR == 2
    struct      {void   MY_NV2(*A,  );      };
#   else
    struct      {void   MY_NV1(*A,  );      };
#   endif

#endif

    struct {
        uint32_t
            Mant:   23,
            Expo:   8,
            Sign:   1,
            :       0;
    };
    union {
#if defined(_MSC_VER)
#   pragma pack(push,1)
        uint32_t    U;
        int32_t     I;
        float       F;
#   pragma pack(pop)
#else
        uint32_t    U __attribute__((packed));
        int32_t     I __attribute__((packed));
        float       F __attribute__((packed));
#endif

    } M;

} Word;

typedef union Dwrd {
    char        C[8];
    Byte        B[8];
    Half        H[4];
    Word        W[2];
    union       {Du1 U; Di1 I; Df1 F;} M1;
    union       {Wu2 U; Wi2 I; Wf2 F;} M2;
    union       {Hu4 U; Hi4 I; Hf4 F;} M4;
    union       {Bu8 U; Bi8 I; Bc8 C;} M8;
    uint64_t    U;
    int64_t     I;
    double      F;
    struct      {bool   MY_NV64(Y, :1), :0; };
    struct      {char   MY_NV8( C,  );      };
    struct      {Byte   MY_NV8( B,  );      };
    struct      {Half   MY_NV4( H,  );      };
    struct      {Word   MY_NV2( W,  );      };
    struct      {Word   MY_PAIR(Lo, Hi,  ); };
#if DWRD_NPTR
    void    *A[DWRD_NPTR];
#   if   DWRD_NPTR == 4
    struct      {void   MY_NV4(*A,  );      };
#   elif DWRD_NPTR == 2
    struct      {void   MY_NV2(*A,  );      };
#   else
    struct      {void   MY_NV1(*A,  );      };
#   endif

#endif
    struct {
        uint64_t
            Mant:   52,
            Expo:   11,
            Sign:   1,
            :       0;
    };
    union {
#if defined(_MSC_VER)
#   pragma pack(push,1)
        uint64_t    U;
        int64_t     I;
        double      F;
#   pragma pack(pop)
#else
        uint64_t    U __attribute__((packed));
        int64_t     I __attribute__((packed));
        double      F __attribute__((packed));
#endif

    } M;

} Dwrd;

typedef union Quad {
    char        C[16];
    Byte        B[16];
    Half        H[ 8];
    Word        W[ 4];
    Dwrd        D[ 2];
    union       {Qu1  U; Qi1  I; Qf1  F;} M1;
    union       {Du2  U; Di2  I; Df2  F;} M2;
    union       {Wu4  U; Wi4  I; Wf4  F;} M4;
    union       {Hu8  U; Hi8  I; Hf8  F;} M8;
    union       {Bu16 U; Bi16 I; Bc16 C;} M16;
    QUAD_UTYPE  U;
    QUAD_ITYPE  I;
    QUAD_FTYPE  F;
    struct  {bool   MY_NV128(Y, :1), :0;};
    struct  {char   MY_NV16( C, );      };
    struct  {Byte   MY_NV16( B, );      };
    struct  {Half   MY_NV8(  H, );      };
    struct  {Word   MY_NV4(  W, );      };
    struct  {Dwrd   MY_NV2(  D, );      };
    struct  {Dwrd   MY_PAIR(Lo, Hi,  ); };

    void    *A[QUAD_NPTR];
#   if   QUAD_NPTR == 8
    struct  {void   MY_NV8(*A,  );      };
#   elif DWRD_NPTR == 4
    struct  {void   MY_NV4(*A,  );      };
#   elif DWRD_NPTR == 2
    struct  {void   MY_NV2(*A,  );      };
#   else
    struct  {void   MY_NV1(*A,  );      };
#   endif

    union {
#if defined(_MSC_VER)
#   pragma  pack(push,1)
        struct {uint64_t Lo, Hi;} U;
        struct { int64_t Lo, Hi;} I;
        struct {uint64_t Lo, Hi;} F:
#   pragma  pack(pop)
#else

#   if QUAD_NLLONG == 2
        unsigned __int128   U __attribute__((packed));
        signed   __int128   I __attribute__((packed));
#   else
        unsigned long long  U __attribute__((packed));
        signed long long    I __attribute__((packed));
#   endif

#   if LDBL_MANT_DIG == 113
        long double         F __attribute__((packed));
#   else
        unsigned __int128   F __attribute__((packed));
#   endif

#endif

    } M;

} Quad;

#if _ENTER_EXTNUM_SIZES_TEST
{
#endif

#if 1

typedef union {
    struct {uint8_t MY_LV128(L, );};
    struct {uint8_t MY_BV128(B, );};
} MY_SIZES_TEST;

ASSERT(0 == offsetof(MY_SIZES_TEST,L0));
ASSERT(1 == offsetof(MY_SIZES_TEST,L1));
ASSERT(2 == offsetof(MY_SIZES_TEST,L2));
ASSERT(3 == offsetof(MY_SIZES_TEST,L3));
ASSERT(4 == offsetof(MY_SIZES_TEST,L4));
ASSERT(5 == offsetof(MY_SIZES_TEST,L5));
ASSERT(6 == offsetof(MY_SIZES_TEST,L6));
ASSERT(7 == offsetof(MY_SIZES_TEST,L7));
ASSERT(8 == offsetof(MY_SIZES_TEST,L8));

ASSERT(8*14+0  == offsetof(MY_SIZES_TEST,L112));
ASSERT(8*14+7  == offsetof(MY_SIZES_TEST,L119));
ASSERT(8*15+0  == offsetof(MY_SIZES_TEST,L120));
ASSERT(8*15+7  == offsetof(MY_SIZES_TEST,L127));

ASSERT(127-0*1 == offsetof(MY_SIZES_TEST,B0));
ASSERT(127-1*1 == offsetof(MY_SIZES_TEST,B1));
ASSERT(127-2*1 == offsetof(MY_SIZES_TEST,B2));
ASSERT(127-3*1 == offsetof(MY_SIZES_TEST,B3));
ASSERT(127-4*1 == offsetof(MY_SIZES_TEST,B4));
ASSERT(127-5*1 == offsetof(MY_SIZES_TEST,B5));
ASSERT(127-6*1 == offsetof(MY_SIZES_TEST,B6));
ASSERT(127-7*1 == offsetof(MY_SIZES_TEST,B7));
ASSERT(127-8*1 == offsetof(MY_SIZES_TEST,B8));
ASSERT(127-8*2 == offsetof(MY_SIZES_TEST,B16));
ASSERT(127-8*3 == offsetof(MY_SIZES_TEST,B24));
ASSERT(127-8*4 == offsetof(MY_SIZES_TEST,B32));

ASSERT(sizeof(BYTE_TYPE) == 1);
ASSERT(sizeof(BYTE_ITYPE) == 1);
ASSERT(sizeof(BYTE_UTYPE) == 1);

ASSERT(sizeof(HALF_TYPE) == 2);
ASSERT(sizeof(HALF_ITYPE) == 2);
ASSERT(sizeof(HALF_UTYPE) == 2);
ASSERT(sizeof(HALF_FTYPE) == 2);
ASSERT(sizeof(HALF_LOTYPE) == 1);
ASSERT(sizeof(HALF_HITYPE) == 1);

ASSERT(sizeof(WORD_TYPE) == 4);
ASSERT(sizeof(WORD_ITYPE) == 4);
ASSERT(sizeof(WORD_UTYPE) == 4);
ASSERT(sizeof(WORD_FTYPE) == 4);
ASSERT(sizeof(WORD_LOTYPE) == 2);
ASSERT(sizeof(WORD_HITYPE) == 2);

ASSERT(sizeof(DWRD_TYPE) == 8);
ASSERT(sizeof(DWRD_ITYPE) == 8);
ASSERT(sizeof(DWRD_UTYPE) == 8);
ASSERT(sizeof(DWRD_FTYPE) == 8);
ASSERT(sizeof(DWRD_LOTYPE) == 4);
ASSERT(sizeof(DWRD_HITYPE) == 4);

ASSERT(sizeof(QUAD_TYPE) == 16);
ASSERT(sizeof(QUAD_LOTYPE) == 8);
ASSERT(sizeof(QUAD_HITYPE) == 8);

ASSERT( 1 == sizeof(Byte));
ASSERT( 2 == sizeof(Half));
ASSERT( 4 == sizeof(Word));
ASSERT( 8 == sizeof(Dwrd));
ASSERT(16 == sizeof(Quad));

#endif

#if _LEAVE_EXTNUM_SIZES_TEST
}
#endif

#if MY_ENDIAN == ENDIAN_BIG
/*
Vqbu[0] is loaded from (uint8_t[16])[QUAD_B0]

*/

#   define  QUAD_B0     (15)
#   define  QUAD_B1     (14)
#   define  QUAD_B2     (13)
#   define  QUAD_B3     (12)
#   define  QUAD_B4     (11)
#   define  QUAD_B5     (10)
#   define  QUAD_B6     (9)
#   define  QUAD_B7     (8)
#   define  QUAD_B8     (7)
#   define  QUAD_B9     (6)
#   define  QUAD_B10    (5)
#   define  QUAD_B11    (4)
#   define  QUAD_B12    (3)
#   define  QUAD_B13    (2)
#   define  QUAD_B14    (1)
#   define  QUAD_B15    (0)

#   define  QUAD_H0     (15)
#   define  QUAD_H1     (13)
#   define  QUAD_H2     (11)
#   define  QUAD_H3     (9)
#   define  QUAD_H4     (7)
#   define  QUAD_H5     (5)
#   define  QUAD_H6     (3)
#   define  QUAD_H7     (1)

